<a href="https://colab.research.google.com/github/sureshmecad/Google-Colab/blob/master/1_Concat_Merge_Join.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [3]:
import pandas as pd

In [4]:
df1 = pd.DataFrame({'A': [1,2,3], 'B': [10,20,30]})

df2 = pd.DataFrame({'C': [4,5,6], 'D': [10,20,30]})

display(df1, df2)

   A   B
0  1  10
1  2  20
2  3  30

   C   D
0  4  10
1  5  20
2  6  30

In [5]:
df1.join(df2)

   A   B  C   D
0  1  10  4  10
1  2  20  5  20
2  3  30  6  30

------------------------------------

In [7]:
df3 = pd.DataFrame({'A': [1,2,3], 'B': [10,20,30]}, index=['a', 'b', 'c'])

df4 = pd.DataFrame({'C': [4,5,6], 'D': [10,20,30]}, index=['a', 'b', 'c'])

display(df3, df4)

   A   B
a  1  10
b  2  20
c  3  30

   C   D
a  4  10
b  5  20
c  6  30

In [8]:
df3.join(df4)

   A   B  C   D
a  1  10  4  10
b  2  20  5  20
c  3  30  6  30

-----------------

In [9]:
df5 = pd.DataFrame({'A': [1,2,3], 'B': [10,20,30]}, index=['a', 'b', 'c'])

df6 = pd.DataFrame({'C': [4,5], 'D': [40,50]}, index=['a', 'b'])

display(df5, df6)

   A   B
a  1  10
b  2  20
c  3  30

   C   D
a  4  40
b  5  50

In [10]:
# how: {'left', 'right', 'inner', 'outer'} default: 'left'
df5.join(df6)

   A   B    C     D
a  1  10  4.0  40.0
b  2  20  5.0  50.0
c  3  30  NaN   NaN

In [11]:
df5.join(df6, how='right')

   A   B  C   D
a  1  10  4  40
b  2  20  5  50

In [12]:
df5.join(df6, how='inner')

   A   B  C   D
a  1  10  4  40
b  2  20  5  50

In [13]:
df5.join(df6, how='outer')

   A   B    C     D
a  1  10  4.0  40.0
b  2  20  5.0  50.0
c  3  30  NaN   NaN

-------------

### **Same Column names (A & A)**

- lsuffix

- rsuffix

In [14]:
df7 = pd.DataFrame({'A': [1,2,3], 'B': [10,20,30]}, index=['a', 'b', 'c'])

df8 = pd.DataFrame({'A': [4,5], 'D': [40,50]}, index=['a', 'b'])

display(df7, df8)

   A   B
a  1  10
b  2  20
c  3  30

   A   D
a  4  40
b  5  50

In [15]:
df7.join(df8, lsuffix='_1')

   A_1   B    A     D
a    1  10  4.0  40.0
b    2  20  5.0  50.0
c    3  30  NaN   NaN

In [16]:
df7.join(df8, rsuffix='_1')

   A   B  A_1     D
a  1  10  4.0  40.0
b  2  20  5.0  50.0
c  3  30  NaN   NaN